package libs.book



/*
 * ┌ ┐ └ ┘├ ┤ ┬ ┴ ┼ ─ │
 *
 * ┌───────────────────┬───────────────────────────────────┐
 * │ Измерение времени │ val time = measureTimeMillis{...} │
 * └───────────────────┴───────────────────────────────────┘
 * ┌───────────────────┬────────────────────┐
 * │ Создание потока   │                    │
 * ├───────────────────┴────────────────────┤
 * │ val threadWithRunnable = Thread(xxx()) │
 * │ threadWithRunnable.start(              │
 * │                                        │
 * │ class xxx : Runnable {                 │
 * │   override fun run() {                 │
 * │        while (true) { ... } } }        │
 * └────────────────────────────────────────┘

 *
 *
 *




 */

